BMS-Performance.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="BMS-Performance" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">40</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">C:\Users\RAC IT\Desktop\BMS Performance\BMS Users.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">User,Password</stringProp>
        </CSVDataSet>
        <hashTree/>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
          <collectionProp name="CookieManager.cookies"/>
          <boolProp name="CookieManager.clearEachIteration">true</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
        </CookieManager>
        <hashTree/>
        <CacheManager guiclass="CacheManagerGui" testclass="CacheManager" testname="HTTP Cache Manager" enabled="true">
          <boolProp name="clearEachIteration">true</boolProp>
          <boolProp name="useExpires">true</boolProp>
          <boolProp name="CacheManager.controlledByThread">false</boolProp>
        </CacheManager>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="File Paths and URL" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="BASE_URL" elementType="Argument">
              <stringProp name="Argument.name">BASE_URL</stringProp>
              <stringProp name="Argument.value">10.254.152.98:8080/user/login</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="elementwait" elementType="Argument">
              <stringProp name="Argument.name">elementwait</stringProp>
              <stringProp name="Argument.value">70</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="Screenshot" elementType="Argument">
              <stringProp name="Argument.name">Screenshot</stringProp>
              <stringProp name="Argument.value">C:\Users\RAC IT\Desktop\Error ScreenshotsFailureImages</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="AggregatePath" elementType="Argument">
              <stringProp name="Argument.name">AggregatePath</stringProp>
              <stringProp name="Argument.value">Results/AggregateReport</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="ViewResultsPath" elementType="Argument">
              <stringProp name="Argument.name">ViewResultsPath</stringProp>
              <stringProp name="Argument.value">Results/ViewResultTree</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="pause1" elementType="Argument">
              <stringProp name="Argument.name">pause1</stringProp>
              <stringProp name="Argument.value">1000</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="pause2" elementType="Argument">
              <stringProp name="Argument.name">pause2</stringProp>
              <stringProp name="Argument.value">2000</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="pause5" elementType="Argument">
              <stringProp name="Argument.name">pause5</stringProp>
              <stringProp name="Argument.value">5000</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="pause10" elementType="Argument">
              <stringProp name="Argument.name">pause10</stringProp>
              <stringProp name="Argument.value">10000</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="waitToRefresh" elementType="Argument">
              <stringProp name="Argument.name">waitToRefresh</stringProp>
              <stringProp name="Argument.value">30000</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="ThinkTime" elementType="Argument">
              <stringProp name="Argument.name">ThinkTime</stringProp>
              <stringProp name="Argument.value">370</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.config.ChromeDriverConfig guiclass="com.googlecode.jmeter.plugins.webdriver.config.gui.ChromeDriverConfigGui" testclass="com.googlecode.jmeter.plugins.webdriver.config.ChromeDriverConfig" testname="Chrome Driver Config" enabled="true">
          <stringProp name="WebDriverConfig.proxy_type">SYSTEM</stringProp>
          <intProp name="WebDriverConfig.http_port">8080</intProp>
          <boolProp name="WebDriverConfig.use_http_for_all_protocols">true</boolProp>
          <intProp name="WebDriverConfig.https_port">8080</intProp>
          <intProp name="WebDriverConfig.ftp_port">8080</intProp>
          <intProp name="WebDriverConfig.socks_port">8080</intProp>
          <stringProp name="WebDriverConfig.no_proxy">localhost</stringProp>
          <boolProp name="WebDriverConfig.maximize_browser">true</boolProp>
          <boolProp name="WebDriverConfig.reset_per_iteration">false</boolProp>
          <boolProp name="WebDriverConfig.dev_mode">false</boolProp>
          <stringProp name="ChromeDriverConfig.chromedriver_path">C:\Users\RAC IT\Desktop\Performance\chromedriver.exe</stringProp>
          <boolProp name="ChromeDriverConfig.android_enabled">false</boolProp>
          <boolProp name="ChromeDriverConfig.headless_enabled">false</boolProp>
          <boolProp name="ChromeDriverConfig.insecurecerts_enabled">false</boolProp>
          <boolProp name="ChromeDriverConfig.incognito_enabled">false</boolProp>
          <boolProp name="ChromeDriverConfig.no_sandbox_enabled">false</boolProp>
        </com.googlecode.jmeter.plugins.webdriver.config.ChromeDriverConfig>
        <hashTree/>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">${ThinkTime}</stringProp>
        </ConstantTimer>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="false">
          <collectionProp name="Asserion.test_strings"/>
          <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">16</intProp>
        </ResponseAssertion>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="BMS Launch" enabled="true">
          <stringProp name="WebDriverSampler.script">var pkg = JavaImporter(org.openqa.selenium)
var ui = JavaImporter(org.openqa.selenium.support.ui)
var wait = new ui.WebDriverWait(WDS.browser,${elementwait})


WDS.sampleResult.sampleStart()
WDS.browser.get(&apos;http://${BASE_URL}&apos;)
//WDS.browser.get(&apos;http://10.254.152.98:8080/user/login&apos;)


wait.until(ui.ExpectedConditions.visibilityOfElementLocated(pkg.By.xpath(&quot; //p[contains(text(),&apos;Licensed to Panasonic&apos;)]&quot;)))
//WDS.sampleResult.sampleEnd()
</stringProp>
          <stringProp name="WebDriverSampler.language">javascript</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="Login" enabled="true">
          <stringProp name="WebDriverSampler.script">var pkg = JavaImporter(org.openqa.selenium);
var ui = JavaImporter(org.openqa.selenium.support.ui);
var wait = new ui.WebDriverWait(WDS.browser, ${elementwait});
var conditions = org.openqa.selenium.support.ui.ExpectedConditions;
var exception = null;
var fileUtils = JavaImporter(org.apache.qpid.util);
var io = JavaImporter(java.io);

var email = WDS.browser.findElement(pkg.By.id(&quot;username&quot;));
email.sendKeys([&apos;${User}&apos;]);

var password = WDS.browser.findElement(pkg.By.id(&quot;password&quot;));
password.sendKeys([&apos;${Password}&apos;]);

var submit = WDS.browser.findElement(pkg.By.id(&quot;loginButton&quot;));
submit.click();

//java.lang.Thread.sleep(5000);
java.lang.Thread.sleep(${pause5})

var Advance = null;
var proceedLink = null;

WDS.sampleResult.sampleStart()

try {
  Advance = WDS.browser.findElement(pkg.By.xpath(&quot;//button[contains(text(),&apos;Advanced&apos;)]&quot;));
} catch (e) {
  // Element not found, handle the scenario accordingly
  // For example, log the error or perform an alternative action
  WDS.log.error(&quot;Advanced button not found: &quot; + e.message);
}

if (Advance) {
  Advance.click(); // Clicks on the Advanced button if it is present

  try {
    proceedLink = WDS.browser.findElement(pkg.By.id(&quot;proceed-link&quot;));
  } catch (e) {
    // Element not found, handle the scenario accordingly
    // For example, log the error or perform an alternative action
    WDS.log.error(&quot;Proceed link not found: &quot; + e.message);
  }

  if (proceedLink) {
    proceedLink.click(); // Clicks on the Proceed link if it is present
  }
}

try {
	wait.until(ui.ExpectedConditions.visibilityOfElementLocated(pkg.By.xpath(&quot;//span[contains(text(),&apos;Host&apos;)]&quot;)))
} catch (err) {
    WDS.log.error(err.message)
    var screenshot = WDS.browser.getScreenshotAs(pkg.OutputType.FILE)
    screenshot.renameTo(new java.io.File(&apos;${Screenshot}//Login_Page_${__time(ddMM_HHmm,)}.png&apos;))
    exception = err
    throw exception
}

WDS.sampleResult.sampleEnd()</stringProp>
          <stringProp name="WebDriverSampler.language">javascript</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="Open Project" enabled="false">
          <stringProp name="WebDriverSampler.script">var pkg = JavaImporter(org.openqa.selenium)
var ui = JavaImporter(org.openqa.selenium.support.ui)
var wait = new ui.WebDriverWait(WDS.browser,${elementwait})
var conditions = org.openqa.selenium.support.ui.ExpectedConditions
var exception = null
var fileUtils = JavaImporter(org.apache.qpid.util)
var io = JavaImporter(java.io)

var OpenProject = WDS.browser.findElement(pkg.By.xpath(&quot;(//button[@class=&apos;action-btn minimal msl&apos;])[2]&quot;))
OpenProject.click() //Clicks on light management from the side menu

java.lang.Thread.sleep(${pause5})

WDS.sampleResult.sampleStart()

try {
	//Waits until text is visibles in the UI.
	wait.until(ui.ExpectedConditions.visibilityOfElementLocated(pkg.By.xpath(&quot;//h1[contains(text(),&apos;Not Found&apos;)]&quot;))) 
} catch (err) {
    WDS.log.error(err.message)
    var screenshot = WDS.browser.getScreenshotAs(pkg.OutputType.FILE)
    screenshot.renameTo(new java.io.File(&apos;${Screenshot}//Open Project_${__time(ddMM_HHmm,)}.png&apos;))
    exception = err
    throw exception
}

WDS.sampleResult.sampleEnd()</stringProp>
          <stringProp name="WebDriverSampler.language">javascript</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="jp@gc - WebDriver Sampler" enabled="false">
          <stringProp name="WebDriverSampler.script">var pkg = JavaImporter(org.openqa.selenium)
var ui = JavaImporter(org.openqa.selenium.support.ui)
var wait = new ui.WebDriverWait(WDS.browser,${elementwait})
var conditions = org.openqa.selenium.support.ui.ExpectedConditions
var exception = null
var fileUtils = JavaImporter(org.apache.qpid.util)
var io = JavaImporter(java.io)

var OpenProject = WDS.browser.findElement(pkg.By.xpath(&quot;(//button[@class=&apos;action-btn minimal msl&apos;])[2]&quot;))
OpenProject.click()

java.lang.Thread.sleep(${pause5})

WDS.sampleResult.sampleStart()

// Get the current window handle
var currentHandle = WDS.browser.getWindowHandle()
var title = WDS.browser.getTitle();
print(&quot;Window Title: &quot; + title);
print(&quot;First Window ID: &quot; + currentHandle);

// Get all the window handles
var handles = WDS.browser.getWindowHandles()
print(&quot;All Tabs ID&apos;s: &quot; + handles);

// Switch to the new window/tab
for (var handle in handles) {
    if (handle != currentHandle) {
        WDS.browser.switchTo().window(handle)
        break
    }
}
var currentHandle = WDS.browser.getWindowHandle()
var title = WDS.browser.getTitle();
print(&quot;Window Title: &quot; + title);
print(&quot;Second window handle: &quot; + currentHandle);

try {
	//Waits until text is visibles in the UI.
	wait.until(ui.ExpectedConditions.visibilityOfElementLocated(pkg.By.xpath(&quot;//h1[contains(text(),&apos;Not Found&apos;)]&quot;))) 
} catch (err) {
    WDS.log.error(err.message)
    var screenshot = WDS.browser.getScreenshotAs(pkg.OutputType.FILE)
    screenshot.renameTo(new java.io.File(&apos;${Screenshot}//Open Project_${__time(ddMM_HHmm,)}.png&apos;))
    exception = err
    throw exception
}

WDS.sampleResult.sampleEnd()</stringProp>
          <stringProp name="WebDriverSampler.language">javascript</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>